Revit 2027 API
CompoundStructure.GetMinimumLayerThickness Method
 Get the minimum allowable layer thickness.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static double GetMinimumLayerThickness()
Public Shared Function GetMinimumLayerThickness As Double
public:
static double GetMinimumLayerThickness()
static member GetMinimumLayerThickness : unit -> float
Return Value
Double
 The minimum allowable width of a layer in feet.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace